workshop2/lidDrivenCavity/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          transportProperties;
}
// ************************************************************************* //

#include "${FOAM_CASE}/constant/parameters"

transportModel  Newtonian;

nu              #calc "$vel*$dim/$Re";

// ************************************************************************* //
