workshop2/lidDrivenCavity/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/
#include "${FOAM_CASE}/constant/parameters"

type            sets;
libs            ("libsampling.so");

writeControl    writeTime;

interpolationScheme cellPoint;

setFormat   raw;

fields  (U);

setConfig
{
    type    uniform;   // midPoint, midPointAndFace
    axis    distance;  // x, y, z, xyz
    nPoints $size;
}

sets
(
    vertical
    {
        $setConfig;
        start (#calc "$dim/2.0" 0   0);
        end   (#calc "$dim/2.0" $dim 0);
    }
    
    horizontal
    {
        $setConfig;
        start (0   #calc "$dim/2.0" 0);
        end   ($dim #calc "$dim/2.0" 0);
    }
);


// ************************************************************************* //
